module.exports = {
	config: {
		name: "cud",
    aliases: ["baby"],
		version: "1.0",
		author: "otineeeeeyyyyyyyyyyyy",
		role: 0,
		category: "fun",
    shortDescription: "Flirt With Lines",
		longDescription: "",
		guide: {
			vi: "Not Available",
			en: "{p} chik"
		} 
	},

  onStart: async function ({ api, event, userData, args }) {
      var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("কোন হাউয়ার পোলারে চুদবি mention মার", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = []; 
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("๛➣𓆩সবার‣𒁍 চুদা লো");
setTimeout(() => {a({body: "রেন্ডি মাগীর পোলা তর মায়ের ভুদা কালা। 🤢🤮" + " " + name, mentions: arraytag})}, 2000);
setTimeout(() => {a({body: "মুথ ক্ষুর মাগীর ছেলে তর মায়ের ভুদায় মাটি দিয়ে দিবো কঠিন এক চোদন ☺️🥳" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body:"তর মায়েরে ২০ টাকা দিয়ে চোদে তকে জম্ম দিলো Siam,munna, ratul,najmul" + " " + name, mentions: arraytag})}, 4000);
setTimeout(() => {a({body: "বোকাচোদার পোলা Munnar চোদন এ তর জম্ম ☠️🤝" + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "জারজ মাগীর পোলা তর মারে বিদেশি কুত্তা দিয়ে চোদামু 🥰" + " " + name, mentions: arraytag})}, 6000);
setTimeout(() => {a({body: "পতিতা মাগীর পোলা লেজেন্ড গ্রুপের সবার জারজ সন্তান তুই 😍" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "তর মায়ের ভুদা ছিল্লা আম গুজে দিবো 😊" + " " + name, mentions: arraytag})}, 8000);
setTimeout(() => {a({body: "তর মায়ের ভুদায় লাল মরিছ দিয়ে দিবো কঠিন এক চোদন 😔" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "জারজ মাগীর পোলা তর কচি বোনের কচি ভুদায় চোদে ফাটিয়ে দিবো 🤩🤝" + " " + name, mentions: arraytag})}, 10000);
setTimeout(() => {a({body: "চোদন বাজ মাগীর পোলা তর কচি বোনকে dog style দিবো এক কঠিন চোদন 🥰" + " " + name, mentions: arraytag})}, 11000);
setTimeout(() => {a({body: "তর কচি বোনের সুপারি টিপে ডাব বানিয়ে দিবো 🤕" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "খাদ্দাম মাগীর পোলা তর মাকে ফ্রিতে কুত্তা ও চুদে না 😵‍💫" + " " + name, mentions: arraytag})}, 13000);
setTimeout(() => {a({body: "খানকির পোলা তোর বাপ 𝗦𝗜𝗔𝗠,𝗠𝗨𝗡𝗡𝗔,𝗡𝗔𝗝𝗠𝗨𝗟,𝗥𝗔𝗧𝗨𝗟 এর কাছে খমা চা 🥱" + " " + name, mentions: arraytag})}, 14000);
setTimeout(() => {a({body: "Breaking news তোর মায়ের গুদের গন্ধে আতংকিত এলাকাবাসী" + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "খাদ্দাম মাগীর পোলা তর মায়ের কালো ভুদায় লাল আচার লাগিয়ে চোদবো 🤤" + " " + name, mentions: arraytag})}, 16000);
setTimeout(() => {a({body: "বস্তির ছেলে তর মায়ের ভুদাতে পোকা 🤮" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "~  ๛➣𓆩NAJMUL᭄𓆪‣𒁍এর ফাটা কন্ডমের ফসল। জা ভাগ🥱" + " " + name, mentions: arraytag})}, 18000);
setTimeout(() => {a({body: "তোর মার ভোদায় কুত্তার লালা ফেলে চুদি" + " " + name, mentions: arraytag})}, 19000);
setTimeout(() => {a({body: "তোর বোনের কচি ভোদায় চুম্মা দিয়ে চুদি" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "তোর মারে দিনে রাইতে সরিষার তেল দিয়ে চুদি" + " " + name, mentions: arraytag})}, 21000);
setTimeout(() => {a({body:"তোর মারে কান্দে ফালাই চুদি"+ " " + name, mentions: arraytag})}, 22000);
setTimeout(() => {a({body: "তোর মা আর বোনরে একসাথে  doggy style চুদি" + " " + name, mentions: arraytag})}, 23000);
setTimeout(() => {a({body: "তোর মারে কাজ করতে দেখে চুদি" + " " + name, mentions: arraytag})}, 24000);
setTimeout(() => {a({body: "তোর মার কালা ভোদায় ওয়াক থু🤮" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body:"তোর মার গুদ দেখতে গিয়ে মাথা ঘুরে গেলো মুন্নার"+ " " + name, mentions: arraytag})}, 26000);
setTimeout(() => {a({body:"তোর মার ধনে লাকি মলম লাগাই দিবো খানকির ছেলে 😹"+ " " + name, mentions: arraytag})}, 27000);
setTimeout(() => {a({body:"তোর মারে নারিকেল তেল দিয়ে চুদি খনিকের ছেলে🫠"+ " " + name, mentions: arraytag})}, 28000);
setTimeout(() => {a({body:"তুই কারসাথে লাগতে আইছোস জানোসনা"+ " " + name, mentions: arraytag})}, 29000);
setTimeout(() => {a({body:"তোর বড় ভাইদের জিগা Siam কেডা"+ " " + name, mentions: arraytag})}, 30000);
setTimeout(() => {a({body:"চিন্তা করিস্না তোর মাকে কন্ডম লাগিয়ে চুদছি জাতে তোর মত আবালের জন্ম না হয়"+ " " + name, mentions: arraytag})}, 31000);
setTimeout(() => {a({body:"আশা করি ভবিষ্যতে আর আমাদের সাথে লাগতে আসবিনা"+ " " + name, mentions: arraytag})}, 32000);
setTimeout(() => {a({body:"NAJMUL এর কন্ডম না আনার ভুলে তোর জন্ম"+ " " + name, mentions: arraytag})}, 33000);
setTimeout(() => {a({body:"এতটুকু চোদা তোর জন্য enough ok"+ " " + name, mentions: arraytag})}, 34000);
setTimeout(() => {a({body:"তোর আব্বুদের কথা ভুলিস্না জেনো🥱"+ " " + name, mentions: arraytag})}, 35000);
  }
};